// ========= 2.1 ===============

// Привет, мир!
//alert('Я джаваскрипт')



// ==========2.2 ==============
// Структура кода

// alert('Привет (inline)'); alert('Мир (inline)');
//
// alert('Привет');
// alert('Мир');


// alert(3 +
//     1
//     + 2);


// alert('Hello');
//
// [1, 2].forEach(alert);


// alert('Hello')
//
//     [1, 2].forEach(alert);


alert('Hello');[1, 2].forEach(alert);


/* Закомментировали код
alert('Привет');
*/
alert('Мир');


// ========= 2.3 ==============
// Строгий режим — "use strict"